uploads/xml/Travelport-Request-6665f55d49626-8146.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:AirPriceReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:common_v51_0="http://www.travelport.com/schema/common_v51_0" xmlns:univ="http://www.travelport.com/schema/universal_v51_0" TargetBranch="P3763969" TraceId="6fd70b43e2d6ede092b9256aac7143a5">
      <com:BillingPointOfSaleInfo xmlns:com="http://www.travelport.com/schema/common_v51_0" OriginApplication="UAPI"/>
      <air:AirItinerary>
        <air:AirSegment ProviderCode="1G" Key="kugwL/9CuDKAWk4L1hAAAA==" Group="0" Carrier="MS" FlightNumber="734" Origin="DUS" Destination="CAI" DepartureTime="2024-06-22T15:15:00.000+02:00" ArrivalTime="2024-06-22T20:35:00.000+03:00" FlightTime="260" Distance="1932" ETicketability="Yes" Equipment="738" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="Cached status used. Polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="P" AvailabilityDisplayType="Fare Shop/Optimal Shop"/>
        <air:AirSegment ProviderCode="1G" Key="kugwL/9CuDKAok4L1hAAAA==" Group="1" Carrier="MS" FlightNumber="733" Origin="CAI" Destination="DUS" DepartureTime="2024-07-23T10:40:00.000+03:00" ArrivalTime="2024-07-23T14:15:00.000+02:00" FlightTime="275" Distance="1932" ETicketability="Yes" Equipment="321" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="Cached status used. Polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="P" AvailabilityDisplayType="Fare Shop/Optimal Shop"/>
      </air:AirItinerary>
      <air:AirPricingModifiers CurrencyType="SAR"/>
      <com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v51_0" Code="ADT" Age="46" BookingTravelerRef="OTEwMDAzOTI2NjY1ZjU1YzhjOTE4OC44NTM5MTQ5OQ=="/>
      <com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v51_0" Code="ADT" Age="55" BookingTravelerRef="OTEwMDAzOTI2NjY1ZjU1YzhjZTAzNS42OTQ0MDE4Nw=="/>
      <air:AirPricingCommand/>
    </air:AirPriceReq>
  </soapenv:Body>
</soapenv:Envelope>
